Python 3.7.8 (tags/v3.7.8:4b47a5b6ba, Jun 28 2020, 08:53:46) [MSC v.1916 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.
>>> score=[70,90,60,100,50]
>>> cnt=0
>>> for i in range(5):
	if score[i]>=70;
	
SyntaxError: invalid syntax
>>> 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q2.py ===============================================================================================
start num:10
end num:20
전체합계: 11
작수의 합: 90
홀수의 합: 19
>>> 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q1.py ===============================================================================================
count: 3
>>> 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q1.py ===============================================================================================
count: 3
>>> 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q1.py ===============================================================================================
count: 3
>>> 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q2.py ===============================================================================================
start num: 1
end num: 10
전체합계:  55
짝수수의 합:  30
홀수의 합:  9
>>> 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q2.py ===============================================================================================
start num: 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q2.py ===============================================================================================
start num: 
10
end num: 20
전체합계:  165
짝수의 합:  90
홀수의 합:  19
>>> 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q2.py ===============================================================================================
start num: 1
end num: 10
전체합계:  55
짝수의 합:  30
홀수의 합:  9
>>> 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q3.py ===============================================================================================
코딩 시험 결과
------------------------------
Traceback (most recent call last):
  File "C:/Users/infan/OneDrive/문서/파이썬/9강/Q3.py", line 7, in <module>
    for s in scope:
NameError: name 'scope' is not defined
>>> 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q3.py ===============================================================================================
코딩 시험 결과
------------------------------
1번 학생의 점수는 85입니다.
결과는 LEVEL2입니다.

2번 학생의 점수는 95입니다.
결과는 LEVEL1입니다.

3번 학생의 점수는 70입니다.
결과는 LEVEL3입니다.

4번 학생의 점수는 50입니다.
결과는 FAIL입니다.

5번 학생의 점수는 100입니다.
결과는 LEVEL1입니다.

>>> 
=============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/실습1.py ===============================================================================================
주사위 게임 시작
Enter를 치세요
num: 6
com 3 vs user 6, user win
재시작: enter, 종료: 0
num: 4
com 6 vs user 4, com win
재시작: enter, 종료: 0
num: 3
com 4 vs user 3, com win
재시작: enter, 종료: 0
num: 5
com 2 vs user 5, user win
재시작: enter, 종료: 0
num: 3
com 2 vs user 3, user win
재시작: enter, 종료: 0
num: 5
com 3 vs user 5, user win
재시작: enter, 종료: 0
num: 6
com 5 vs user 6, user win
재시작: enter, 종료: 0
num: 6
com 2 vs user 6, user win
재시작: enter, 종료: 0
num: 5
com 2 vs user 5, user win
재시작: enter, 종료: 0
num: 5
com 5 vs user 5, user win
재시작: enter, 종료: 0
num: 5
com 6 vs user 5, com win
재시작: enter, 종료: 0
num: 4
com 2 vs user 4, user win
재시작: enter, 종료: 0
num: 4
com 4 vs user 4, user win
재시작: enter, 종료: 0
num: 0
com 5 vs user 0, com win
재시작: enter, 종료: 0
num: 0
com 1 vs user 0, com win
재시작: enter, 종료: 0
num: 0
com 4 vs user 0, com win
재시작: enter, 종료: 00
>>> 
=============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/도전2.py ===============================================================================================
1) 친구 등록 2) 검색 3) 종료 :1
menu error
1) 친구 등록 2) 검색 3) 종료 :
=============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/도전2.py ===============================================================================================
1) 친구 등록 2) 검색 3) 종료 :1
name: 배청명
phone: 010-2757-9577
1) 친구 등록 2) 검색 3) 종료 :1
name: 배진
phone: 010-234234-2342
1) 친구 등록 2) 검색 3) 종료 :2
name: 배청명
010-2757-9577
1) 친구 등록 2) 검색 3) 종료 :1
name: 배진
phone: 이서린
1) 친구 등록 2) 검색 3) 종료 :2
name: 이서린
not found
1) 친구 등록 2) 검색 3) 종료 :
=============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/도전2.py ===============================================================================================
<원하시는 메뉴 번호를 누르세요>
1)친구 등록 2)검색 3) 종료 [숫자만 입력] :1
<친구등록>
이름 : 배진
전화번호 : 01011112222
<원하시는 메뉴 번호를 누르세요>
1)친구 등록 2)검색 3) 종료 [숫자만 입력] :1
<친구등록>
이름 : 배청명
전화번호 : 01022223333
<원하시는 메뉴 번호를 누르세요>
1)친구 등록 2)검색 3) 종료 [숫자만 입력] :1
<친구등록>
이름 : 문영희
전화번호 : 01033334444
<원하시는 메뉴 번호를 누르세요>
1)친구 등록 2)검색 3) 종료 [숫자만 입력] :1
<친구등록>
이름 : 이서린
전화번호 : 01034445555
<원하시는 메뉴 번호를 누르세요>
1)친구 등록 2)검색 3) 종료 [숫자만 입력] :1
<친구등록>
이름 : 이서연
전화번호 : 01055556666
<원하시는 메뉴 번호를 누르세요>
1)친구 등록 2)검색 3) 종료 [숫자만 입력] :2
<검색>
이름 : 이서린
검색 내용이 없습니다
<원하시는 메뉴 번호를 누르세요>
1)친구 등록 2)검색 3) 종료 [숫자만 입력] :2
<검색>
이름 : 이서연
검색 내용이 없습니다
<원하시는 메뉴 번호를 누르세요>
1)친구 등록 2)검색 3) 종료 [숫자만 입력] :2
<검색>
이름 : 배청명
검색 내용이 없습니다
<원하시는 메뉴 번호를 누르세요>
1)친구 등록 2)검색 3) 종료 [숫자만 입력] :
============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/lotto.py ==============================================================================================
로또 프로그램 시작
추첨된 번호
[37, 14, 27, 20, 2, 26]
>>> 
============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/lotto.py ==============================================================================================
로또 프로그램 시작
추첨된 번호
Traceback (most recent call last):
  File "C:/Users/infan/OneDrive/문서/파이썬/9강/lotto.py", line 16, in <module>
    lotto.sor()
AttributeError: 'list' object has no attribute 'sor'
>>> 
============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/lotto.py ==============================================================================================
로또 프로그램 시작
추첨된 번호
14
19
26
29
36
43
>>> 
============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/lotto.py ==============================================================================================
로또 프로그램 시작
추첨된 번호
4 7 16 17 27 32 
>>> 
============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/lotto.py ==============================================================================================
로또 프로그램 시작
추첨된 번호
3 5 16 25 39 40 
>>> 
============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/lotto.py ==============================================================================================
로또 프로그램 시작
추첨된 번호
11 15 18 26 28 45 
>>> 
============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/lotto.py ==============================================================================================
로또 프로그램 시작
추첨된 번호
[3, 5, 9, 11, 24, 41]
>>> 
============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/lotto.py ==============================================================================================
>>> 
로또 프로그램 시작
추첨된 번호
[8, 9, 22, 30, 33, 39]
>>> 
============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/lotto.py ==============================================================================================
로또 프로그램 시작
추첨된 번호
10 12 21 22 33 45 
>>> 
=============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/도전2.py ===============================================================================================
1) 친구 등록 2) 검색 3) 종료 :1
name: 달님이
phone: 01000000000
1) 친구 등록 2) 검색 3) 종료 :1
name: 이서린
phone: 01011112222
1) 친구 등록 2) 검색 3) 종료 :2
name: 달님이
01000000000
1) 친구 등록 2) 검색 3) 종료 :2
name: 이서린
01011112222
1) 친구 등록 2) 검색 3) 종료 :3
프로그램이 종료됩니다
>>> 
=============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/도전2.py ===============================================================================================
1) 친구 등록 2) 검색 3) 종료 :4
menu error
1) 친구 등록 2) 검색 3) 종료 :6
menu error
1) 친구 등록 2) 검색 3) 종료 :1
name: 배청명
phone: 01027579577
1) 친구 등록 2) 검색 3) 종료 :2
name: 배청명
01027579577
1) 친구 등록 2) 검색 3) 종료 :2
name: 문영희
not found
1) 친구 등록 2) 검색 3) 종료 :
=============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/도전2.py ===============================================================================================

1) 친구 등록 2) 검색 3) 종료 :1
name: 배진
phone: 01063416495

1) 친구 등록 2) 검색 3) 종료 :2
name: 배청명
not found

1) 친구 등록 2) 검색 3) 종료 :2
name: 배진
01063416495

1) 친구 등록 2) 검색 3) 종료 :배진
Traceback (most recent call last):
  File "C:/Users/infan/OneDrive/문서/파이썬/9강/도전2.py", line 7, in <module>
    s = int(input('\n1) 친구 등록 2) 검색 3) 종료 :'))
ValueError: invalid literal for int() with base 10: '배진'
>>> addr.keys()
dict_keys(['배진'])
>>> addr.value()
Traceback (most recent call last):
  File "<pyshell#6>", line 1, in <module>
    addr.value()
AttributeError: 'dict' object has no attribute 'value'
>>> 
=============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/도전2.py ===============================================================================================

1) 친구 등록 2) 검색 3) 종료 :1
name: 배청명
phone: 01027579577

1) 친구 등록 2) 검색 3) 종료 :1
name: 배진
phone: 01063426495

1) 친구 등록 2) 검색 3) 종료 :1
name: 이서린
phone: 01000000000

1) 친구 등록 2) 검색 3) 종료 :1
name: 이서연
phone: 01000000001

1) 친구 등록 2) 검색 3) 종료 :1
name: 문영희
phone: 01076622605

1) 친구 등록 2) 검색 3) 종료 :2
name: 이서린
01000000000

1) 친구 등록 2) 검색 3) 종료 :2
name: 이서연
01000000001

1) 친구 등록 2) 검색 3) 종료 :2
name: 배진
01063426495

1) 친구 등록 2) 검색 3) 종료 :3
프로그램이 종료됩니다
>>> addr.keys
<built-in method keys of dict object at 0x000001F66E02A8B8>
>>> addr.keys()
dict_keys(['배청명', '배진', '이서린', '이서연', '문영희'])
>>> addr.values()
dict_values(['01027579577', '01063426495', '01000000000', '01000000001', '01076622605'])
>>> addr.items()
dict_items([('배청명', '01027579577'), ('배진', '01063426495'), ('이서린', '01000000000'), ('이서연', '01000000001'), ('문영희', '01076622605')])
>>> addr.items()
dict_items([('배청명', '01027579577'), ('배진', '01063426495'), ('이서린', '01000000000'), ('이서연', '01000000001'), ('문영희', '01076622605')])
>>> addr['최선미']=01012341234
SyntaxError: invalid token
>>> addr['최선미']='01012341234'
>>> addr['이주연']='01012121234'
>>> addr['조금주']='01032133214'
>>> dict.items()
Traceback (most recent call last):
  File "<pyshell#16>", line 1, in <module>
    dict.items()
TypeError: descriptor 'items' of 'dict' object needs an argument
>>> dict_items()
Traceback (most recent call last):
  File "<pyshell#17>", line 1, in <module>
    dict_items()
NameError: name 'dict_items' is not defined
>>> addr.items()
dict_items([('배청명', '01027579577'), ('배진', '01063426495'), ('이서린', '01000000000'), ('이서연', '01000000001'), ('문영희', '01076622605'), ('최선미', '01012341234'), ('이주연', '01012121234'), ('조금주', '01032133214')])
>>> addr.keys()
dict_keys(['배청명', '배진', '이서린', '이서연', '문영희', '최선미', '이주연', '조금주'])
>>> addr.values()
dict_values(['01027579577', '01063426495', '01000000000', '01000000001', '01076622605', '01012341234', '01012121234', '01032133214'])
>>> 
=========================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/guess_number.py ==========================================================================================


♥ ♥ ♥ 이서린, 이서연을 위한!! ♥ ♥ ♥

★ 하트뿅뿅♥ 재미있는 컴퓨터 게임♥ ♥ ♥ ★

"제1탄"

<<컴퓨터가 생각한 1~20까지 숫자 맞추기~~~>>


[게임방법] 컴퓨터가 1~20까지의 숫자중 한개의 숫자를 생각했어요. 컴퓨터가 생각한 숫자가 무엇인지 맞춰봅시당 ^>^

          게임종료는 언제든지 숫자 0 을 눌러주세용~~ ♥ ♥ ♥

숫자 입력(종료0): 5

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 9

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 8

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 7

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 6
정답!

5번 만에 맞췄어요! :D
한판 더 고고?? (y/n) : 
=========================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/guess_number.py ==========================================================================================


♥ ♥ ♥ 이서린, 이서연을 위한!! ♥ ♥ ♥

★ 하트뿅뿅♥ 재미있는 컴퓨터 게임♥ ♥ ♥ ★

"제1탄"

<<컴퓨터가 생각한 1~20까지 숫자 맞추기~~~>>


[게임방법] 컴퓨터가 1~20까지의 숫자중 한개의 숫자를 생각했어요. 컴퓨터가 생각한 숫자가 무엇인지 맞춰봅시당 ^>^

          게임종료는 언제든지 숫자 0 을 눌러주세용~~ ♥ ♥ ♥

숫자 입력(종료0): 10

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 7

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 6

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 4

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 3

 정답!

5번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : 
=========================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/guess_number.py ==========================================================================================


♥ ♥ ♥ 이서린, 이서연을 위한!! ♥ ♥ ♥

★ 하트뿅뿅♥ 재미있는 컴퓨터 게임♥ ♥ ♥ ★

"제1탄"

<<컴퓨터가 생각한 1~20까지 숫자 맞추기~~~>>


[게임방법] 컴퓨터가 1~20까지의 숫자중 한개의 숫자를 생각했어요. 컴퓨터가 생각한 숫자가 무엇인지 맞춰봅시당 ^>^

          게임종료는 언제든지 숫자 0 을 눌러주세용~~ ♥ ♥ ♥

숫자 입력(종료0): 
Traceback (most recent call last):
  File "C:/Users/infan/OneDrive/문서/파이썬/9강/guess_number.py", line 13, in <module>
    player = int(input('\n숫자 입력(종료0): '))
ValueError: invalid literal for int() with base 10: ''
>>> 
=========================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/guess_number.py ==========================================================================================


♥ ♥ ♥ 이서린, 이서연을 위한!! ♥ ♥ ♥

★ 하트뿅뿅♥ 재미있는 컴퓨터 게임♥ ♥ ♥ ★

"제1탄"

<<컴퓨터가 생각한 1~20까지 숫자 맞추기~~~>>


[게임방법] 컴퓨터가 1~20까지의 숫자중 한개의 숫자를 생각했어요. 컴퓨터가 생각한 숫자가 무엇인지 맞춰봅시당 ^>^

          게임종료는 언제든지 숫자 0 을 눌러주세용~~ ♥ ♥ ♥

숫자 입력(종료0): 9

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 13

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 17

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 16

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 15

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 14

 ★정답!

★6번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 10

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 15

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 13

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 14

 ★정답!

★10번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : 
=========================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/guess_number.py ==========================================================================================


♥ ♥ ♥ 이서린, 이서연을 위한!! ♥ ♥ ♥

★ 하트뿅뿅♥ 재미있는 컴퓨터 게임♥ ♥ ♥ ★

"제1탄"

<<컴퓨터가 생각한 1~20까지 숫자 맞추기~~~>>


[게임방법] 컴퓨터가 1~20까지의 숫자중 한개의 숫자를 생각했어요. 컴퓨터가 생각한 숫자가 무엇인지 맞춰봅시당 ^>^

          게임종료는 언제든지 숫자 0 을 눌러주세용~~ ♥ ♥ ♥

숫자 입력(종료0): 5

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 3

 ★정답!

★2번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 8

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 5

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 3

 ★정답!

★3번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 10

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 5

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 3

 ★정답!

★3번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 5

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 3

 ★정답!

★2번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 3

 ★정답!

★1번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 3

 ★정답!

★1번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : n
>>> 
=========================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/guess_number.py ==========================================================================================


♥ ♥ ♥ 이서린, 이서연을 위한!! ♥ ♥ ♥

★ 하트뿅뿅♥ 재미있는 컴퓨터 게임♥ ♥ ♥ ★

"제1탄"

<<컴퓨터가 생각한 1~20까지 숫자 맞추기~~~>>


[게임방법] 컴퓨터가 1~20까지의 숫자중 한개의 숫자를 생각했어요. 컴퓨터가 생각한 숫자가 무엇인지 맞춰봅시당 ^>^

          게임종료는 언제든지 숫자 0 을 눌러주세용~~ ♥ ♥ ♥

숫자 입력(종료0): 10

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 15

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 18

 ★정답!

★3번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 18

 ★정답!

★1번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 18

 ★정답!

★1번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : 
=========================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/guess_number.py ==========================================================================================


♥ ♥ ♥ 이서린, 이서연을 위한!! ♥ ♥ ♥

★ 하트뿅뿅♥ 재미있는 컴퓨터 게임♥ ♥ ♥ ★

"제1탄"

<<컴퓨터가 생각한 1~20까지 숫자 맞추기~~~>>


[게임방법] 컴퓨터가 1~20까지의 숫자중 한개의 숫자를 생각했어요. 컴퓨터가 생각한 숫자가 무엇인지 맞춰봅시당 ^>^

          게임종료는 언제든지 숫자 0 을 눌러주세용~~ ♥ ♥ ♥

숫자 입력(종료0): 10

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 5

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 7

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 8

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 9

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 6

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 7

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 6

 ★정답!

★8번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 5

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 8

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 9

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 10

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 14

 ★정답!

★5번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 14

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 11

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 9

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 7

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 5

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 6

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 7

 ★정답!

★7번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : 
=========================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/guess_number.py ==========================================================================================


♥ ♥ ♥ 이서린, 이서연을 위한!! ♥ ♥ ♥

★ 하트뿅뿅♥ 재미있는 컴퓨터 게임♥ ♥ ♥ ★

"제1탄"

<<컴퓨터가 생각한 1~20까지 숫자 맞추기~~~>>


[게임방법] 컴퓨터가 1~20까지의 숫자중 한개의 숫자를 생각했어요. 컴퓨터가 생각한 숫자가 무엇인지 맞춰봅시당 ^>^

          게임종료는 언제든지 숫자 0 을 눌러주세용~~ ♥ ♥ ♥

숫자 입력(종료0): 8

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 11

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 15

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 18

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 19

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 20

 ★정답!

★6번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 20

 ★정답!

★1번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 20

 ★정답!

★1번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : 
=========================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/guess_number.py ==========================================================================================


♥ ♥ ♥ 이서린, 이서연을 위한!! ♥ ♥ ♥

★ 하트뿅뿅♥ 재미있는 컴퓨터 게임♥ ♥ ♥ ★

"제1탄"

<<컴퓨터가 생각한 1~20까지 숫자 맞추기~~~>>


[게임방법] 컴퓨터가 1~20까지의 숫자중 한개의 숫자를 생각했어요. 컴퓨터가 생각한 숫자가 무엇인지 맞춰봅시당 ^>^

          게임종료는 언제든지 숫자 0 을 눌러주세용~~ ♥ ♥ ♥

숫자 입력(종료0): 8

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 5

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 4

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 5

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 6

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 7

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 8

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 9

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 10

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 9

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 8

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 9

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 7

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 6

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 5

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 6

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 7

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 9

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 13

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 13

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 12

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 13

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 15

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 
=========================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/guess_number.py ==========================================================================================


♥ ♥ ♥ 이서린, 이서연을 위한!! ♥ ♥ ♥

★ 하트뿅뿅♥ 재미있는 컴퓨터 게임♥ ♥ ♥ ★

"제1탄"

<<컴퓨터가 생각한 1~20까지 숫자 맞추기~~~>>


[게임방법] 컴퓨터가 1~20까지의 숫자중 한개의 숫자를 생각했어요. 컴퓨터가 생각한 숫자가 무엇인지 맞춰봅시당 ^>^

          게임종료는 언제든지 숫자 0 을 눌러주세용~~ ♥ ♥ ♥

숫자 입력(종료0): 7

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 5

*힌트: 더 작은 숫자! 파이팅!!


숫자 입력(종료0): 3

*힌트: 더 큰 숫자! 파이팅!!


숫자 입력(종료0): 4

 ★정답!

★4번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : y

숫자 입력(종료0): 4

 ★정답!

★1번 만에 맞췄어요! :D

한판 더 고고?? (y/n) : 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q1.py ===============================================================================================
count: 3
>>> 
============================================================================================== RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/lotto.py ==============================================================================================
로또 프로그램 시작
추첨된 번호
1 3 11 13 22 37 
>>> 
================================================================================================ RESTART: C:/Users/infan/OneDrive/문서/파이썬/9강/Q2.py ===============================================================================================
start num: 1
end num: 10
전체합계:  55
짝수의 합:  30
홀수의 합:  9
>>> 